Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of the essential nature of nonentities.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། མི་གནས་པའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of nondwelling.

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། ནམ་མཁའི་མཚན་ཉིད་དོ།
en: Divine princes, this profound perfection of wisdom has the defining characteristic of space. “

source: །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། མཚན་ཉིད་དེ་ལྟ་བུ་ཡིན་ཡང་། དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་གྱི་བརྡར་བཀའ་སྩལ་ཏེ། དོན་དམ་པར་ནི་མ་ཡིན་ནོ།
en: Divine princes, although this profound perfection of wisdom has such defining characteristics, the tathāgatas have expressed it in worldly conventional terms, but that is not the case in ultimate truth.

source: །ལྷའི་བུ་དག་མཚན་ཉིད་དེ་དག་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་གཞན་དུ་བྱ་བར་མི་ནུས་སོ།
en: Divine princes, these defining characteristics cannot be altered by the world with its gods, humans, and asuras.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཡང་མཚན་ཉིད་དེར་ཟད་དེ།
en: If you ask why, it is because the world with its gods, humans, and asuras is also endowed with those very same defining characteristics.

source: །ལྷའི་བུ་དག་མཚན་ཉིད་ནི་མཚན་ཉིད་གཞན་དུ་མི་བྱེད་དོ།
en: Divine princes, defining characteristics do not alter defining characteristics.

source: །མཚན་ཉིད་ནི་མཚན་ཉིད་ཤེས་པར་མི་བྱེད་དོ།
en: Defining characteristics do not cognize defining characteristics.

source: །མཚན་ཉིད་ནི་མཚན་ཉིད་མེད་པ་ཤེས་པར་མི་བྱེད་དོ།
en: Defining characteristics do not cognize the absence of defining characteristics.

source: །མཚན་ཉིད་མེད་པ་ནི་མཚན་ཉིད་མེད་པ་ཤེས་པར་མི་བྱེད་དོ། །དེ་ལྟར་ན་མཚན་ཉིད་དང་།
en: The absence of defining characteristics does not cognize the absence of defining characteristics.

source: མཚན་ཉིད་མེད་པ་དང་། མཚན་ཉིད་ཡོད་པ་དང་། མཚན་ཉིད་མེད་པ་དེ་གཉིས་ཀ་ལ་ཡང་གང་གིས་ཤེས་པར་བྱ་བ་དང་། གང་ཤེས་པར་བྱ་བ་དང་། གང་ཤེས་པར་བྱེད་པ་དེ་ལྟ་བུ་མི་སྲིད་དོ།
en: Therefore, as far as defining characteristics, absence of defining characteristics, both the presence and absence of defining characteristics, and neither the presence nor absence of defining characteristics are concerned, it is impossible for them to be known by anyone, for any of them to be known, or for them to know anything. “

source: །ལྷའི་བུ་དག་མཚན་ཉིད་དེ་དག་ནི་གཟུགས་ཀྱིས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: Divine princes, these defining characteristics have not been conditioned by physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: They have not been conditioned by feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: They have not been conditioned by the sense fields, the sensory elements, or the links of dependent origination.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: They have not been conditioned by the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: They have not been conditioned by the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་ཀྱིས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: They have not been conditioned by the aspects of emptiness.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: They have not been conditioned by the factors conducive to enlightenment.

source: །འཕགས་པའི་བདེན་པ་རྣམས་ཀྱིས་འདུས་བྱས་པ་མ་ཡིན་ནོ། །བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: They have not been conditioned by the truths of the noble ones.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱིས་འདུས་བྱས་པ་མ་ཡིན་ནོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱིས་འདུས་བྱས་པ་མ་ཡིན་ནོ།
en: They have not been conditioned by the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas. “

source: །ལྷའི་བུ་དག་མཚན་ཉིད་དེ་དག་ནི་མིའམ། མི་མ་ཡིན་པའམ། ཟག་པ་དང་བཅས་པའམ། ཟག་པ་མེད་པའམ། འཇིག་རྟེན་པའམ།
en: Divine princes, these defining characteristics are neither human nor nonhuman; they are neither contaminated nor are they uncontaminated; they are neither mundane, nor are they supramundane; and they are neither conditioned, nor are they unconditioned. “

source: འཇིག་རྟེན་ལས་འདས་པའམ།
en: Divine princes, {Ki.

source: འདུས་བྱས་སམ། །འདུས་མ་བྱས་ཀྱིས་མ་ཡིན་ཏེ། ལྷའི་བུ་དག་ལ་ལ་ཞིག་འདི་སྐད་དུ་ནམ་མཁའི་མཚན་ཉིད་གང་ཡིན་ཞེས་ཟེར་ན། ཅི་དེ་ཡང་དག་པར་སྨྲ་བས། ཡང་དག་པར་སྨྲ་བ་ཡིན་ནམ།
en: IV: 69} if someone were to ask what is the defining characteristic of space, would they be speaking correctly?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ། ཡང་དག་པར་སྨྲ་བས།
en: Blessed Lord, they would not be speaking correctly.

source: ཡང་དག་པར་སྨྲ་བ་མ་ལགས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་འདུས་མ་བགྱིས་པའི་སླད་དུ་ནམ་མཁའ་ལ་ནི་མཚན་ཉིད་གང་ཡང་མ་མཆིས་སོ།
en: If one were to ask why, Blessed Lord, it is because space, insofar as it is unconditioned, is not endowed with any defining characteristic whatsoever.” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་སྟེ། མཚན་ཉིད་མེད་པའི་དབྱིངས་དེ་ནི་དེ་བཞིན་དུ་གནས་སོ། །མཚན་ཉིད་མེད་པའི་དབྱིངས་ཇི་ལྟ་བ་བཞིན་དུ་གནས་པ་དེ་ནི།
en: Divine princes,” continued the Blessed One, “whether the tathāgatas have appeared or whether the tathāgatas have not appeared [in the world], the expanse that is without defining characteristics dwells in that manner.

source: དེ་བཞིན་གཤེགས་པས་མ་ནོར་བར་མངོན་པར་སངས་རྒྱས་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ།
en: The tathāgatas are called tathāgatas because they have unerringly attained consummate buddhahood.”

source: །དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then those gods inhabiting the realm of desire and inhabiting the realm of form said to the Blessed One, “Blessed Lord.

source: །བཅོམ་ལྡན་འདས་མཚན་ཉིད་དེ་དག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གཟིགས་པ་ཆོས་ཐམས་ཅད་ལ་ཐོགས་པ་མ་མཆིས་པར་འཇུག་ཅིང་མཚན་ཉིད་དེ་དག་ལ་ཞུགས་པས།
en: the tathāgatas engage in the perception of wisdom that is unobstructed with respect to all phenomena because they have attained consummate buddhahood with regard to those defining characteristics.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཚན་ཉིད་ཐམས་ཅད་ཀྱི་ཆགས་པ་ལས་འདས་པ་འདི་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དག་པར་བསྟན་པས། མཚན་ཉིད་རྣམས་རབ་ཏུ་བསྟན་པ་ནི།
en: It is having entered into these defining characteristics that the tathāgatas, arhats, completely awakened buddhas have attained consummate buddhahood with regard to this perfection of wisdom that transcends attachment to all defining characteristics, and, even after attaining consummate buddhahood, they continue to reveal these defining characteristics by revealing the perfection of wisdom.

source: དེ་བཞིན་གཤེགས་པས། མཚན་ཉིད་ཟབ་མོ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Such are the profound defining characteristics with respect to which the tathāgatas attain consummate buddhahood. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དུ་གྱུར་ཏེ། དེ་ལ་སྤྱད་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། མཚན་ཉིད་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བར་མཛད་དེ།
en: Blessed Lord, how wonderful is this profound perfection of wisdom within the perceptual range of the tathāgatas, arhats, completely awakened buddhas, by engaging in which the tathāgatas, arhats, completely awakened buddhas attain consummate buddhahood in unsurpassed, complete enlightenment, and even after attaining consummate buddhahood in unsurpassed, complete enlightenment, they continue to distinguish between all defining characteristics!

source: འདི་ལྟར་གཟུགས་ཀྱི་མཚན་ཉིད་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་མཚན་ཉིད་དང་། སྐྱེ་མཆེད་ཀྱི་མཚན་ཉིད་དང་ཁམས་ཀྱི་མཚན་ཉིད་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་མཚན་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་མཚན་ཉིད་རབ་ཏུ་དབྱེ་བ་མཛད་པ་ངོ་མཚར་ཆེའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: In this manner they distinguish between the defining characteristics of physical forms, the defining characteristics of feelings, perceptions, formative predispositions, and consciousness, the defining characteristics of the sense fields, the defining characteristics of the sensory elements, the defining characteristics of the links of dependent origination, and the defining characteristics of [all the other attributes and goals], up to and including all-aspect omniscience!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ཡོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ལ་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་གཟུགས་ནི་གཞིག་ཏུ་རུང་བའི་མཚན་ཉིད་དེ། དེ་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The Blessed One then said to the gods inhabiting the realm of desire and those inhabiting the realm of form, “Divine princes, physical forms have the defining characteristic of being perishable, but the tathāgatas attain consummate buddhahood with respect to the absence of this defining characteristic.

source: །དེ་བཞིན་དུ་ཚོར་བ་ནི་མྱོང་བའི་མཚན་ཉིད། འདུ་ཤེས་ནི་འཛིན་པའི་མཚན་ཉིད། འདུ་བྱེད་ནི་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད། རྣམ་པར་ཤེས་པ་ནི་སོ་སོའི་བྱེ་བྲག་ཤེས་པའི་མཚན་ཉིད་དེ། དེ་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Similarly, feelings have the defining characteristic of emotional experience, perceptions have the defining characteristic of comprehensibility, formative predispositions have the defining characteristic of conditioning, and consciousness has the defining characteristic of awareness of particularities, but the tathāgatas attain consummate buddhahood with respect to the absence of these defining characteristics. “

source: །ཕུང་པོ་རྣམས་ནི་སྡུག་བསྔལ་གྱི་མཚན་ཉིད། ཁམས་རྣམས་ནི་གདུག་པའི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །སྐྱེ་མཆེད་རྣམས་ནི་འབྱུང་བའི་སྒོའི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་བས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The psycho-physical aggregates have the defining characteristic of suffering, the sensory elements have the defining characteristic of being present, and the sense fields have the defining characteristic of being the sensory gates for the arising [of perception], but the tathāgatas attain consummate buddhahood with respect to the absence of these defining characteristics.

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ནི་འདུ་འཕྲོད་ཀྱི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The links of dependent origination have the defining characteristics of absorption and diffusion, but the tathāgatas attain consummate buddhahood with respect to the absence of these defining characteristics. “

source: །ལྷའི་བུ་དག་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡོངས་སུ་གཏོང་བའི་མཚན་ཉིད་དེ། དེ་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གདུང་བ་མེད་པའི་མཚན་ཉིད།
en: Divine princes, the perfection of generosity has the defining characteristic of renunciation, but the tathāgatas attain consummate buddhahood with respect to the absence of this defining characteristic.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཁྲུག་པ་མེད་པའི་མཚན་ཉིད། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཐུབ་པ་མེད་པའི་མཚན་ཉིད། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡང་དག་པར་སྡུད་པའི་མཚན་ཉིད། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཆགས་པ་མེད་པའི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The perfection of ethical discipline has the defining characteristic of noninvolvement, the perfection of tolerance has the defining characteristic of imperturbability, the perfection of perseverance has the defining characteristic of invincibility, the perfection of meditative concentration has the defining characteristic of total focus, and the perfection of wisdom has the defining characteristic of nonattachment, but the tathāgatas attain consummate buddhahood with respect to the absence of these defining characteristics. “

source: །བསམ་གཏན་བཞི་དང་ཚད་མེད་པ་བཞི་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དག་ནི་མི་འཁྲུགས་པའི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The four meditative concentrations, the four immeasurable attitudes, and the four formless absorptions have the defining characteristic of nondisturbance, but the tathāgatas attain consummate buddhahood with respect to the absence of that defining characteristic. {Ki.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནི་འབྱུང་བའི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: IV: 70} The thirty-seven factors conducive to enlightenment have the defining characteristic of emancipation, but the tathāgatas attain consummate buddhahood with respect to the absence of that defining characteristic.

source: །རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་ནི་དབེན་པའི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Emptiness as a gateway to liberation has the defining characteristic of voidness, but the tathāgatas attain consummate buddhahood with respect to the absence of that defining characteristic.

source: །རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པ་ནི་ཞི་བའི་མཚན་ཉིད་དེ། དེ་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Signlessness as a gateway to liberation has the defining characteristic of quiescence, but the tathāgatas attain consummate buddhahood with respect to the absence of this defining characteristic.

source: །རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པ་ནི་སྡུག་བསྔལ་སེལ་བའི་མཚན་ཉིད་དེ། དེ་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །རྣམ་པར་ཐར་པ་རྣམས་ནི་འགྲེལ་བའི་མཚན་ཉིད་དེ། དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །སྟོབས་རྣམས་ནི་ཤིན་དུ་རྣམ་པར་གདོན་མི་ཟ་བའི་མཚན་ཉིད།
en: Wishlessness as a gateway to liberation has the defining characteristic of alleviating suffering, but the tathāgatas attain consummate buddhahood with respect to the absence of this defining characteristic.

source: མི་འཇིགས་པ་རྣམས་ནི་ཤིན་དུ་བརྟན་པའི་མཚན་ཉིད། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་ནི་ཡོངས་སུ་མི་ཆོད་པའི་མཚན་ཉིད།
en: The aspects of liberation have the defining characteristic of release, but the tathāgatas attain consummate buddhahood with respect to the absence of this defining characteristic.

source: བྱམས་པ་ཆེན་པོ་ནི་ཕན་པར་སྒྲུབ་པའི་མཚན་ཉིད། སྙིང་རྗེ་ཆེན་པོ་ནི་སྐྱོབ་པའི་མཚན་ཉིད། དགའ་བ་ཆེན་པོ་ནི་རབ་ཏུ་དགའ་བའི་མཚན་ཉིད། བཏང་སྙོམས་ཆེན་པོ་ནི་མ་འདྲེས་པའི་མཚན་ཉིད། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་མི་འཕྲོགས་པའི་མཚན་ཉིད་དེ།
en: The powers [of the tathāgatas] have the defining characteristic of absolute definitiveness, the four fearlessnesses have the defining characteristic of absolute stability, the kinds of exact knowledge have the defining characteristic of nonseverance, great loving kindness has the defining characteristic of being beneficial, great compassion has the defining characteristic of being protective, great empathetic joy has the defining characteristic of being joyful, great equanimity has the defining characteristic of being untainted, and the eighteen distinct qualities of the buddhas have the defining characteristic of noncaptivation, but the tathāgatas attain consummate buddhahood with respect to the absence of these defining characteristics.

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ནི་མངོན་སུམ་གྱི་མཚན་ཉིད་དེ།
en: The wisdom of all-aspect omniscience has the defining characteristic of being directly perceived, but the tathāgatas attain consummate buddhahood with respect to the absence of this defining characteristic.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པས་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ལྷའི་བུ་དག་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས། དེའི་ཕྱིར་ན་དེ་བཞིན་གཤེགས་པ་ནི་ཆགས་པ་མི་མངའ་བའི་ཡེ་ཤེས་ཅན་ཞེས་བྱའོ།
en: So it is, divine princes, that because the tathāgatas attain consummate buddhahood with respect to the absence of the defining characteristics of all phenomena, the tathāgatas are said to have wisdom without attachment.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་སྐྱེད་པ་སྟེ།
en: Then the Blessed One addressed the venerable Subhūti: “Subhūti, the perfection of wisdom gives birth to the tathāgatas.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་སྟོན་པའོ།
en: The perfection of wisdom reveals the world to them.

source: །དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་འདི་ལ་བརྟེན་ཅིང་རྣམ་པར་སྤྱོད་དོ།
en: Therefore, the tathāgatas, arhats, completely awakened buddhas act in dependence on this Dharma of the perfection of wisdom.

source: །ཆོས་དེ་ལ་རིམ་གྲོར་མཛད་ཅིང་མཆོད་པ་མཛད་དོ།
en: They serve and worship that Dharma.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་བཞིན་གཤེགས་པ་རིམ་གྲོ་མཛད་པ་དང་བཀུར་བསྟི་མཛད་པ་དང་བསྟི་སྟང་མཛད་པ་དང་། མཆོད་པ་མཛད་པ་དེ་ནི་ཆོས་དང་ལྡན་པ་སྟེ།
en: The perfection of wisdom has attributes that the tathāgatas serve, venerate, respect, and worship.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་བྱུང་སྟེ།
en: If you ask why, Subhūti, the lord buddhas have originated from this perfection of wisdom.

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་བྱས་པ་མཁྱེན་པའོ།
en: Subhūti, the tathāgatas, arhats, completely awakened buddhas appreciate that.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་བྱས་པ་དགོངས་པའོ།
en: The tathāgatas, arhats, completely awakened buddhas are thankful for that.

source: །རབ་འབྱོར་གང་ལ་ལ་ཞིག་ཡང་དག་པར་སྨྲ་བས་བྱས་པ་ཤེས་ཤིང་བྱས་པ་དྲན་པའོ་ཞེས་སྨྲ་ན། དེ་བཞིན་གཤེགས་པ་ལ་བྱས་པ་མཁྱེན་ཅིང་བྱས་པ་དགོངས་པའོ་ཞེས་ཡང་དག་པར་སྨྲ་བས། ཡང་དག་པར་སྨྲའོ། །རབ་འབྱོར་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བྱས་པ་མཁྱེན་ཅིང་བྱས་པ་དགོངས་པ་ཡིན་ཞེ་ན།
en: Subhūti, as someone who truly expresses appreciation and thankfulness, to say truly that the tathāgatas appreciate it and that they are thankful for it is indeed to speak truly.

source: རབ་འབྱོར་དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐེག་པ་གང་གིས་བྱོན་པ་དང་། ལམ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་པའི་ཐེག་པ་དེ་ཉིད་དང་ལམ་དེ་ཉིད་ལ། དེ་བཞིན་གཤེགས་པ་རིམ་གྲོ་མཛད་པ་དང་། བཀུར་བསྟི་མཛད་པ་དང་བསྟི་སྟང་མཛད་པ་དང་མཆོད་པ་མཛད་པ་དང་། ཡོངས་སུ་བསྲུང་བ་མཛད་པའི་ཕྱིར་ཏེ།
en: Subhūti, if you ask how the tathāgatas appreciate it and are thankful for it, it is, Subhūti, because the tathāgatas serve, respect, honor, worship, and protect that very vehicle by which the tathāgatas, arhats, completely awakened buddhas reach, and that very path by which they attain, consummate buddhahood in unsurpassed, complete enlightenment.

source: རབ་འབྱོར་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་བྱས་པ་མཁྱེན་པ་དང་།
en: In this sense, Subhūti, it should be recognized that the tathāgatas appreciate it and are thankful for it. {

source: བྱས་པ་དགོངས་པར་བལྟའོ།
en: Ki.

source: །རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་ལ་བརྟེན་ཏེ། བྱེད་པ་པོ་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་མ་བྱས་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: IV: 71} “Moreover, Subhūti, the tathāgatas have attained consummate buddhahood [knowing], contingent on the signlessness of all phenomena, that all phenomena are uncreated because there is no agent.

source: །ལུས་མེད་པའི་ཕྱིར་མ་བྱས་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: They have attained consummate buddhahood [knowing] that [all phenomena] are uncreated because they have no corporeality.

source: །རབ་འབྱོར་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྟེན་ཏེ། ཆོས་ཐམས་ཅད་ལ་བྱ་བ་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ནི།
en: So it is, Subhūti, that the tathāgatas have attained consummate buddhahood dependent on the profound perfection of wisdom, [knowing] that all phenomena are inactive.

source: །དེ་བཞིན་གཤེགས་པའི་བྱས་པ་མཁྱེན་པ་དང་བྱས་པ་དགོངས་པའོ།
en: This is the appreciation and thankfulness of the tathāgatas. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྟེན་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་བྱས་པ་མེད་པ། །ཆོས་ཐམས་ཅད་ལ་འཇུག་པ་མེད་པའི་བརྡས་འཇུག་སྟེ།
en: Moreover, Subhūti, it is dependent on this perfection of wisdom that the tathāgatas, arhats, completely awakened buddhas symbolically engage with the uncreated wisdom, which does not engage with anything.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་བསྐྱེད་པའོ། །འཇིག་རྟེན་འདི་སྟོན་པའོ།
en: This is the formulation, Subhūti, that explains how this perfection of wisdom gives birth to the tathāgatas, and reveals this world to them.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་ཤེས་པ་པོ་མ་མཆིས་ཤིང་། མཐོང་བ་པོ་མ་མཆིས་ན། ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་བསྐྱེད་ཅིང་འཇིག་རྟེན་འདི་སྟོན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “Blessed Lord, if there is no knowing and no perceiving of any phenomena, how then does the perfection of wisdom give birth to the tathāgatas, and reveal this world to them?” “

source: ཆོས་ཐམས་ཅད་ནི་ཤེས་པ་པོ་མེད་ཅིང་མཐོང་བ་པོ་མེད་པའོ།
en: There is no knowing and no perceiving of any phenomena.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་གསོག་གསོབ་དབང་མེད་པ། སྙིང་པོ་མེད་པ་སྟེ།
en: Subhūti, all phenomena are empty, vacuous, hollow, powerless, and essenceless.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་ཆོས་ཐམས་ཅད་ནི་ཤེས་པ་པོ་མེད་ཅིང་མཐོང་བ་པོ་མེད་པའོ།
en: This is the formulation, Subhūti, that explains how there is no knowing and no perceiving of any phenomena. “

source: །རབ་འབྱོར་གཞན་ཡང་ཆོས་ཐམས་ཅད་ནི་ཤེས་པ་པོ་མེད་ཅིང་མཐོང་བ་པོ་མེད་པ་སྟེ། རབ་འབྱོར་ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་ཤེས་པ་པོ་མེད་ཅིང་མཐོང་བ་པོ་མེད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་མི་གནས་ཤིང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་སྟེ།
en: Moreover, Subhūti, regarding there being no knowing and no perceiving of any phenomena: Subhūti, if you ask how there is no knowing and no perceiving of any phenomena, it is the case, Subhūti, that all phenomena are nondwelling and noninclusive.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་ཆོས་ཐམས་ཅད་ཤེས་པ་པོ་མེད་ཅིང་མཐོང་བ་པོ་མེད་པ་སྟེ།
en: This formulation, Subhūti, explains how there is no knowing and no perceiving of any phenomena.

source: རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་འདི་སྟོན་པའོ།
en: Subhūti, so it is that the perfection of wisdom gives birth to the tathāgatas, and reveals this world to them. “

source: །དེ་ཡང་གཟུགས་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: It also reveals the world because there is no perceiving of physical forms.
